public/stash/piano.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="../subjects.html">Subjects</a> &gt; <a href="stash.html">Stash</a> &gt;
</p>

<div id="outline-container-org7382eb9" class="outline-2">
<h2 id="org7382eb9">Piano</h2>
<div class="outline-text-2" id="text-org7382eb9">
<p>
I started playing piano at a young age. I was fortunate enough to have
many family members who play instruments even professionally or just
for passion, so it was easy to find a rusty keyboard that I could play
with.  I followed lessons from a friend of my father for a some time,
however I liked discovering songs by myself and being self tough so I
stopped going shortly after.
</p>

<p>
I have a beautiful Yamaha P525, the only luxurious thing I own.
</p>

<p>
My favorite composer is Ludovico Einaudi, and has always been since
the very first days. I have a deep emotional connection with many of
his songs, I dedicated hundreds if not thousands of hours playing his
songs over my lifetime, I even went to a live concert in Siracusa.  My
favorite above all is <a href="https://youtu.be/3uFG-T1yiHg?si=Df8Tjwwd0zqNCH4F">Nuvole Bianche</a>. The only author that comes
close to him is Ryan O'Neal aka Sleeping At Last, I also have a strong
emotional connection to his songs.
</p>

<p>
Fortunately, I recorded and uploaded many of my performances <a href="https://www.youtube.com/@giovannisantini6094/videos">on
youtube</a> so I can rewatch them now. Unfortunately most of the videos
are with the old rusty keyboard. I like playing songs from Yiruma in
particular <a href="https://youtu.be/3-mf49DLpOw?si=SxmHwNg6i78hT6eD">River Flows in You</a>, various <a href="https://youtu.be/J-8SGnwsDYI?si=YVZmziXnQTlegH-K">anime music</a> especially from
<a href="https://youtu.be/HtxVl4dozxY?si=ZJNTdSTMEoHdH7TC">Radwimps</a>.
</p>

<hr />

<p>
Travel: <a href="stash.html">Stash</a>, <a href="../theindex.html">Index</a> 
</p>
</div>
</div>
</div>
</body>
</html>
